using System;
using System.Collections.Generic;
using System.Linq;
using System.Runtime.InteropServices;
using System.Text;
using System.Threading.Tasks;

//Данный файл содержит все примеры из урока, кроме классов
namespace XLabLesson2_2
{
    internal class Program
    {
       
       static void Main(string[] args)
        {
            /* Обычный элс иф
            int a = 5;
            int b = 5;
            int c = 10;

            if (b > a)
            {
                Console.WriteLine($"Число {b} больше числа {a}");
            }
            else if (b < a)
            {
                Console.WriteLine($"Число {a} больше числа {b}");
            }
            else
            {
                Console.WriteLine($"Число {a} равно числу {b}");
            }
            */

            // -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

            /* Обычный фор
            for (int i = 1; i < 10; i++)
            {
                Console.WriteLine(i);
            }
            */

            // -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

            /* Обычный вайл
             int i = 0;
             while (i <= 10)
             {
                 Console.WriteLine(i);
                 i++;
             }
            */

            // -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

            /* Массив(ы)
            int[] numbers = new int[5];
            int[] numbers2 = { 5, 6, 7, 8, 9 };
            numbers2[4] = 15;
            Console.WriteLine(numbers[4]);
            */

            // -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

            /* Функции методы 
            void Helloworld()
            {
                Console.WriteLine("Hello world");
            }
            void Sum(int a, int b)
            {
                int sum = a + b;
                Console.WriteLine(sum);
            }
            void Human(string name, int age)
            {
                Console.WriteLine($"{name}, {age}");
            }
            Human("Сергей", 24);
            */

            

        
        }
    }
}
